//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Виконання кроку %d з %d: формування сховища сутностей";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Виконання кроку %d з %d: створення бази даних для початкового завантаження";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Виконання кроку %d з %d: створення бази даних для черги запитів";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Виконання кроку %d з %d:  завантаження сховища сутностей. Наразі отримано %s з %s’.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Виконання кроку %d з %d: видалення запитів з минулим строком";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Виконання кроку %d з %d: завантаження метаданих";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Виконання кроку %d з %d: виконання обєднання черги запитів";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Виконання кроку %d з %d: виконання обєднання транзакцій";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Виконання кроку %d з %d: виконання створення видалення обєднання";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Виконання кроку %d з %d: обробка визначаючих запитів %s з використанням %s’";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Виконання кроку %d з %d: обробка запитів. Відправлення запиту на модифікацію %s з %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Виконання кроку %d з %d: повторне застосування змін";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Виконання кроку %d з %d: аналіз отриманих даних";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Виконання кроку %d з %d: отримання даних з сервера. Наразі отримано %s’.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Виконання кроку %d з %d: вилучення видалених відношень";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Виконання кроку %d з %d: видалення запитів, вказаних як RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Виконання кроку %d з %d: відправлення даних на сервер. Наразі відправлено %s’.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Виконання кроку %d з %d:  відправлення бази даних сховища сутностей. Наразі відправлено %s з %s’.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Виконання кроку %d з %d:  відправлення бази даних черги запитів. Наразі відправлено %s з %s’.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Виконання кроку %d з %d: початок комунікації з сервером";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Виконання кроку %d з %d: попередня обробка запитів перед вивантаженням";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Виконання кроку %d з %d: очікування на завантаження";
